/****************************************
* name:zcityData
* tips:城市数据
****************************************/
var zcityData = {
"0":["北京","上海","天津","重庆","河北","山西","河南","辽宁","吉林","黑龙江","内蒙古","江苏","山东","安徽","浙江","湖北","福建","广东","湖南","江西","广西","海南","四川","云南","贵州","陕西","西藏","青海","甘肃","新疆","宁夏","台湾","香港","澳门","钓鱼岛"],
"0_0":["北京"],
"0_1":["上海"],
"0_2":["天津"],
"0_3":["重庆"],
"0_4":["承德市","衡水市","唐山市","廊坊市","秦皇岛市","石家庄市","保定市","沧州市","邯郸市","张家口市","邢台市"],
"0_5":["晋城市","大同市","运城市","吕梁市","晋中市","忻州市","长治市","朔州市","临汾市","阳泉市","太原市"],
"0_6":["商丘市","信阳市","济源市","濮阳市","郑州市","焦作市","南阳市","安阳市","周口市","平顶山市","三门峡市","洛阳市","漯河市","新乡市","鹤壁市","开封市","许昌市","驻马店市"],
"0_7":["鞍山市","营口市","盘锦市","抚顺市","阜新市","本溪市","辽阳市","丹东市","铁岭市","沈阳市","锦州市","大连市","朝阳市","葫芦岛市"],
"0_8":["延边州","白山市","白城市","四平市","吉林市","辽源市","长春市","松原市","通化市"],
"0_9":["齐齐哈尔市","鸡西市","大庆市","大兴安岭地区","七台河市","双鸭山市","哈尔滨市","佳木斯市","绥化市","伊春市","黑河市","鹤岗市","牡丹江市"],
"0_10":["巴彦淖尔市","锡林郭勒盟","包头市","乌兰察布市","呼伦贝尔市","鄂尔多斯市","赤峰市","呼和浩特市","通辽市","阿拉善盟","兴安盟","乌海市"],
"0_11":["无锡市","淮安市","泰州市","苏州市","常州市","连云港市","扬州市","徐州市","盐城市","南京市","镇江市","宿迁市","南通市"],
"0_12":["淄博市","潍坊市","枣庄市","菏泽市","莱芜市","东营市","德州市","滨州市","济南市","聊城市","威海市","泰安市","青岛市","济宁市","日照市","烟台市","临沂市"],
"0_13":["蚌埠市","滁州市","芜湖市","淮北市","阜阳市","淮南市","黄山市","合肥市","池州市","六安市","宣城市","亳州市","铜陵市","安庆市","宿州市","马鞍山市"],
"0_14":["绍兴市","台州市","湖州市","温州市","宁波市","金华市","舟山市","丽水市","衢州市","嘉兴市","杭州市"],
"0_15":["十堰市","咸宁市","襄阳市","天门市","恩施州","潜江市","孝感市","仙桃市","神农架林区","随州市","黄冈市","荆门市","鄂州市","荆州市","黄石市","武汉市","宜昌市"],
"0_16":["漳州市","宁德市","南平市","莆田市","厦门市","福州市","龙岩市","泉州市","三明市"],
"0_17":["珠海市","惠州市","汕头市","云浮市","佛山市","湛江市","梅州市","广州市","揭阳市","阳江市","潮州市","清远市","深圳市","茂名市","江门市","河源市","中山市","韶关市","汕尾市","东莞市","肇庆市"],
"0_18":["湘潭市","郴州市","岳阳市","株洲市","张家界市","怀化市","衡阳市","韶山市","常德市","邵阳市","永州市","湘西州","娄底市","长沙市","益阳市"],
"0_19":["萍乡市","吉安市","景德镇市","抚州市","九江市","宜春市","鹰潭市","赣州市","上饶市","新余市","南昌市"],
"0_20":["玉林市","河池市","来宾市","梧州市","百色市","北海市","南宁市","防城港市","桂林市","钦州市","贵港市","贺州市","崇左市","柳州市"],
"0_21":["琼中县","白沙县","昌江县","屯昌县","三沙市","乐东县","保亭县","陵水县","五指山市","文昌市","定安县","澄迈县","临高县","儋州市","三亚市","琼海市","东方市","万宁市","海口市"],
"0_22":["资阳市","达州市","凉山州","宜宾市","阿坝州","攀枝花市","巴中市","遂宁市","自贡市","广元市","雅安市","广安市","甘孜州","南充市","内江市","泸州市","乐山市","眉山市","成都市","绵阳市","德阳市"],
"0_23":["楚雄州","昆明市","丽江市","昭通市","保山市","文山州","大理州","红河州","临沧市","迪庆州","玉溪市","普洱市","德宏州","曲靖市","西双版纳州","怒江州"],
"0_24":["六盘水市","安顺市","黔南州","黔东南州","贵阳市","黔西南州","毕节市","遵义市","铜仁市"],
"0_25":["汉中市","宝鸡市","安康市","渭南市","铜川市","咸阳市","延安市","榆林市","商洛市","西安市"],
"0_26":["山南地区","林芝地区","日喀则地区","阿里地区","拉萨市","那曲地区","昌都地区"],
"0_27":["西宁市","玉树州","黄南州","海北州","海西州","果洛州","海东地区","海南州"],
"0_28":["嘉峪关市","天水市","陇南市","酒泉市","甘南州","定西市","庆阳市","金昌市","白银市","平凉市","临夏州","张掖市","武威市","兰州市"],
"0_29":["阿克苏地区","阿勒泰地区","昌吉州","博尔塔拉蒙古自治州阿拉山口口岸","巴音郭楞州","乌鲁木齐市","喀什地区","塔城地区","五家渠市","克拉玛依市","吐鲁番地区","图木舒克市","阿拉尔市","石河子市","哈密地区","克孜勒苏州","伊犁州","和田地区","博尔塔拉州"],
"0_30":["银川市","固原市","中卫市","石嘴山市","吴忠市"],
"0_31":["台湾"],
"0_32":["香港特别行政区"],
"0_33":["澳门市"],
"0_34":["钓鱼岛"],
"0_0_0":["大兴区","房山区","通州区","怀柔区","顺义区","密云区","平谷区","东城区","崇文区","海淀区","西城区","朝阳区","石景山区","门头沟","宣武区","丰台区","延庆县","昌平区"],
"0_1_0":["虹口区","杨浦区","闸北区","长宁区","徐汇区","崇明县","静安区","浦东新区","黄浦区","嘉定区","宝山区","闵行区","奉贤区","金山区","松江区","青浦区","普陀区"],
"0_2_0":["河西区","河东区","河北区","和平区","东丽区","塘沽区","西青区","武清区","津南区","红桥区","蓟县","静海县","南开区","宁河县","汉沽区","大港区","北辰区","宝坻区"],
"0_3_0":["石柱县","巫山县","垫江县","綦江区","彭水县","秀山县","酉阳县","武隆县","黔江区","奉节县","丰都县","云阳县","开县","巫溪县","忠县","城口县","北部新区","高新区","渝中区","璧山县","南川区","江北区","梁平县","南岸区","涪陵区","铜梁县","万州区","荣昌县","大渡口区","永川区","长寿区","大足区","九龙坡区","渝北区","江津区","沙坪坝区","北碚区","潼南县","巴南区","合川区"],
"0_4_0":["鹰手营子矿区","双滦区","双桥区","隆化县","围场县","宽城县","丰宁县","平泉县","承德县","滦平县","兴隆县"],
"0_4_1":["冀州市","深州市","饶阳县","枣强县","故城县","阜城县","安平县","武邑县","桃城区","景县","武强县"],
"0_4_2":["丰润区","滦南县","开平区","曹妃甸区","迁安市","古冶区","玉田县","滦县","路南区","乐亭县","路北区","丰南区","遵化市","迁西县"],
"0_4_3":["文安县","开发区","大厂县","三河市","霸州市","广阳区","安次区","大城县","香河县","永清县","固安县"],
"0_4_4":["北戴河区","海港区","青龙县","昌黎县","山海关区","卢龙县","抚宁县"],
"0_4_5":["辛集市","元氏县","藁城市","无极县","鹿泉市","深泽县","正定县","赞皇县","新华区","井陉矿区","井陉县","栾城县","行唐县","桥东区","灵寿县","桥西区","高邑县","长安区","赵县","裕华区","晋州市","新乐市","平山县"],
"0_4_6":["满城县","涞水县","清苑县","安国市","高碑店市","涿州市","顺平县","博野县","徐水县","雄县","定州市","易县","曲阳县","蠡县","高阳县","容城县","涞源县","望都县","阜平县","定兴县","唐县","安新县","南市区","北市区","新市区"],
"0_4_7":["吴桥县","东光县","孟村县","海兴县","盐山县","南皮县","泊头市","沧县","新华区","肃宁县","青县","运河区","黄骅市","河间市","任丘市","献县"],
"0_4_8":["魏县","馆陶县","曲周县","峰峰矿区","鸡泽县","涉县","大名县","成安县","永年县","邯郸县","邯山区","复兴区","丛台区","武安市","肥乡县","邱县","广平县","临漳县","磁县"],
"0_4_9":["下花园区","万全县","涿鹿县","蔚县","桥西区","尚义县","桥东区","崇礼县","怀来县","怀安县","沽源县","赤城县","阳原县","张北县","宣化区","康保县","宣化县"],
"0_4_10":["威县","南和县","新河县","内丘县","临西县","巨鹿县","平乡县","柏乡县","任县","南宫市","宁晋县","沙河市","临城县","广宗县","清河县","隆尧县","桥东区","桥西区","邢台县"],
"0_5_0":["高平市","阳城县","泽州县","城区","沁水县","陵川县"],
"0_5_1":["南郊区","矿区","城区","天镇县","大同县","阳高县","灵丘县","浑源县","左云县","广灵县","新荣区"],
"0_5_2":["万荣县","夏县","临猗县","新绛县","平陆县","永济市","稷山县","芮城县","垣曲县","绛县","闻喜县","河津市","盐湖区"],
"0_5_3":["中阳县","文水县","临县","兴县","离石区","汾阳市","孝义市","柳林县","方山县","岚县","交口县","石楼县","交城县"],
"0_5_4":["寿阳县","左权县","祁县","榆次区","昔阳县","介休市","榆社县","平遥县","灵石县","和顺县","太谷县"],
"0_5_5":["原平市","五台县","偏关县","代县","神池县","五寨县","保德县","定襄县","忻府区","岢岚县","宁武县","静乐县","繁峙县","河曲县"],
"0_5_6":["郊区","襄垣县","屯留县","平顺县","黎城县","壶关县","长子县","城区","武乡县","沁县","沁源县","长治县","潞城市"],
"0_5_7":["平鲁区","怀仁县","朔城区","右玉县","应县","山阴县"],
"0_5_8":["霍州市","侯马市","吉县","汾西县","尧都区","洪洞县","乡宁县","永和县","蒲县","大宁县","浮山县","安泽县","曲沃县","翼城县","襄汾县","隰县","古县"],
"0_5_9":["矿区","城区","平定县","郊区","盂县"],
"0_5_10":["古交市","迎泽区","阳曲县","小店区","清徐县","万柏林区","娄烦县","晋源区","尖草坪区","杏花岭区"],
"0_6_0":["永城市","睢阳区","宁陵县","睢县","梁园区","虞城县","民权县","夏邑县","柘城县"],
"0_6_1":["潢川县","商城县","光山县","固始县","罗山县","新县","平桥区","淮滨县","浉河区","息县"],
"0_6_2":["轵城镇","城区","王屋镇","思礼镇","邵原镇","五龙口镇","下冶镇","承留镇","梨林镇","坡头镇","大峪镇","克井镇"],
"0_6_3":["台前县","清丰县","濮阳县","南乐县","华龙区","范县"],
"0_6_4":["新密市","上街区","新郑市","巩义市","荥阳市","中牟县","经济开发区","高新技术开发区","登封市","中原区","管城区","二七区","惠济区","郑东新区","金水区"],
"0_6_5":["沁阳市","中站区","山阳区","解放区","博爱县","武陟县","温县","马村区","修武县","孟州市"],
"0_6_6":["唐河县","南召县","卧龙区","内乡县","新野县","社旗县","桐柏县","方城县","淅川县","西峡县","镇平县","邓州市","宛城区"],
"0_6_7":["文峰区","开发区","汤阴县","北关区","内黄县","安阳县","滑县","殷都区","林州市","龙安区"],
"0_6_8":["东新区","鹿邑县","经济开发区","太康县","扶沟县","西华县","项城市","淮阳县","商水县","川汇区","郸城县","沈丘县"],
"0_6_9":["舞钢市","郏县","叶县","鲁山县","宝丰县","新华区","卫东区","湛河区","石龙区","汝州市"],
"0_6_10":["渑池县","湖滨区","义马市","灵宝市","陕县","卢氏县"],
"0_6_11":["瀍河区","涧西区","西工区","老城区","吉利区","洛宁县","洛龙区","宜阳县","栾川县","新安县","伊滨区","嵩县","孟津县","偃师市","伊川县","汝阳县"],
"0_6_12":["召陵区","临颍县","舞阳县","郾城区","源汇区"],
"0_6_13":["原阳县","获嘉县","新乡县","辉县市","卫辉市","凤泉区","牧野区","红旗区","卫滨区","封丘县","长垣县","延津县"],
"0_6_14":["鹤山区","淇县","浚县","淇滨区","山城区"],
"0_6_15":["尉氏县","鼓楼区","禹王台区","金明区","顺河区","龙亭区","开封县","通许县","兰考县","杞县"],
"0_6_16":["魏都区","许昌县","长葛市","襄城县","鄢陵县","禹州市"],
"0_6_17":["正阳县","汝南县","平舆县","西平县","遂平县","驿城区","新蔡县","确山县","泌阳县","上蔡县"],
"0_7_0":["台安县","海城市","铁东区","岫岩县","立山区","铁西区","千山区"],
"0_7_1":["大石桥市","盖州市","鲅鱼圈区","老边区","西市区","站前区"],
"0_7_2":["盘山县","大洼县","双台子区","兴隆台区"],
"0_7_3":["东洲区","望花区","顺城区","新抚区","抚顺县","新宾县","清原县"],
"0_7_4":["清河门区","阜新县","彰武县","细河区","新邱区","太平区","海州区"],
"0_7_5":["溪湖区","明山区","平山区","本溪县","南芬区","桓仁县"],
"0_7_6":["宏伟区","文圣区","灯塔市","白塔区","辽阳县","太子河区","弓长岭区"],
"0_7_7":["宽甸县","振安区","振兴区","凤城市","东港市","元宝区"],
"0_7_8":["银州区","清河区","开原市","铁岭县","昌图县","调兵山市","西丰县"],
"0_7_9":["和平区","于洪区","沈北新区","浑南新区","皇姑区","大东区","铁西区","东陵区","沈河区","苏家屯区","康平县","辽中县","法库县","新民市"],
"0_7_10":["古塔区","凌河区","义县","太和区","北镇市","凌海市","经济技术开发区","黑山县"],
"0_7_11":["庄河市","金州区","中山区","长海县","旅顺口区","瓦房店市","普兰店市","高新园区","甘井子区","西岗区","大连开发区","沙河口区"],
"0_7_12":["双塔区","龙城区","喀喇沁左翼县","北票市","凌源市","建平县","朝阳县"],
"0_7_13":["南票区","龙港区","兴城市","连山区","建昌县","绥中县"],
"0_8_0":["安图县","延吉市","和龙市","汪清县","珲春市","龙井市","图们市","敦化市"],
"0_8_1":["江源区","靖宇县","浑江区","临江市","长白县","抚松县"],
"0_8_2":["洮北区","镇赉县","通榆县","洮南市","大安市"],
"0_8_3":["双辽市","公主岭市","梨树县","伊通县","铁东区","铁西区"],
"0_8_4":["丰满区","永吉县","磐石市","舒兰市","蛟河市","桦甸市","昌邑区","船营区","龙潭区"],
"0_8_5":["东辽县","龙山区","西安区","东丰县"],
"0_8_6":["绿园区","净月区","宽城区","二道区","经济技术开发区","汽车产业开发区","高新技术开发区","九台市","朝阳区","榆树市","南关区","农安县","德惠市","双阳区"],
"0_8_7":["宁江区","前郭县","扶余县","长岭县","乾安县"],
"0_8_8":["通化县","东昌区","辉南县","柳河县","二道江区","梅河口市","集安市"],
"0_9_0":["梅里斯区","富拉尔基区","昂昂溪区","讷河市","碾子山区","拜泉县","富裕县","铁锋区","龙沙区","建华区","甘南县","依安县","克山县","龙江县","克东县","泰来县"],
"0_9_1":["密山市","鸡冠区","滴道区","梨树区","恒山区","鸡东县","城子河区","虎林市","麻山区"],
"0_9_2":["红岗区","让胡路区","龙凤区","萨尔图区","肇源县","肇州县","林甸县","大同区","杜尔伯特县"],
"0_9_3":["加格达奇区","松岭区","呼中区","新林区","漠河县","塔河县","呼玛县"],
"0_9_4":["勃利县","桃山区","新兴区","茄子河区"],
"0_9_5":["四方台区","集贤县","宝山区","宝清县","尖山区","友谊县","岭东区","饶河县"],
"0_9_6":["宾县","方正县","巴彦县","依兰县","木兰县","通河县","延寿县","五常市","尚志市","双城市","阿城区","松北区","呼兰区","南岗区","道里区","香坊区","道外区","平房区"],
"0_9_7":["前进区","向阳区","东风区","同江市","桦南县","富锦市","汤原县","桦川县","抚远县","郊区"],
"0_9_8":["庆安县","青冈县","明水县","兰西县","绥棱县","海伦市","肇东市","安达市","北林区","望奎县"],
"0_9_9":["带岭区","汤旺河区","乌马河区","五营区","上甘岭区","红星区","乌伊岭区","铁力市","西林区","嘉荫县","友好区","南岔区","伊春区","金山屯区","美溪区","新青区","翠峦区"],
"0_9_10":["嫩江县","爱辉区","孙吴县","五大连池市","逊克县","北安市"],
"0_9_11":["萝北县","兴安区","绥滨县","东山区","工农区","南山区","兴山区","向阳区"],
"0_9_12":["林口县","东安区","东宁县","阳明区","宁安市","西安区","穆棱市","绥芬河市","海林市","爱民区"],
"0_10_0":["临河区","磴口县","五原县","乌拉特中旗","杭锦后旗","乌拉特后旗","乌拉特前旗"],
"0_10_1":["多伦县","阿巴嘎旗","锡林浩特市","二连浩特市","苏尼特右旗","苏尼特左旗","西乌珠穆沁旗","东乌珠穆沁旗","正蓝旗","镶黄旗","太仆寺旗","正镶白旗"],
"0_10_2":["固阳县","青山区","九原区","昆都仑区","土默特右旗","白云矿区","达茂联合旗","石拐区","东河区"],
"0_10_3":["四子王旗","察哈尔右翼中旗","察哈尔右翼后旗","凉城县","商都县","察哈尔右翼前旗","化德县","丰镇市","集宁区","卓资县","兴和县"],
"0_10_4":["牙克石市","满洲里市","海拉尔区","陈巴尔虎旗","额尔古纳市","根河市","扎兰屯市","鄂伦春旗","新巴尔虎右旗","新巴尔虎左旗","阿荣旗","鄂温克族旗","莫力达瓦旗"],
"0_10_5":["康巴什新区","东胜区","准格尔旗","伊金霍洛旗","乌审旗","杭锦旗","鄂托克旗","鄂托克前旗","达拉特旗"],
"0_10_6":["元宝山区","巴林左旗","松山区","克什克腾旗","阿鲁科尔沁旗","翁牛特旗","喀喇沁旗","林西县","巴林右旗","红山区","宁城县","敖汉旗"],
"0_10_7":["托克托县","土默特左旗","清水河县","和林格尔县","武川县","赛罕区","玉泉区","回民区","新城区"],
"0_10_8":["奈曼旗","扎鲁特旗","开鲁县","库伦旗","科尔沁左翼后旗","科尔沁区","科尔沁左翼中旗","霍林郭勒市"],
"0_10_9":["阿拉善左旗","阿拉善右旗","额济纳旗"],
"0_10_10":["科尔沁右翼中旗","科尔沁右翼前旗","扎赉特旗","突泉县","阿尔山市","乌兰浩特市"],
"0_10_11":["海南区","乌达区","海勃湾区"],
"0_11_0":["惠山区","江阴市","锡山区","滨湖区","新区","宜兴市","崇安区","北塘区","南长区"],
"0_11_1":["楚州区","清河区","淮阴区","清浦区","涟水县","洪泽县","经济开发区","盱眙县","金湖县"],
"0_11_2":["姜堰市","海陵区","高港区","兴化市","靖江市","泰兴市"],
"0_11_3":["沧浪区","高新区","相城区","金阊区","太仓市","虎丘区","吴中区","平江区","常熟市","工业园区","张家港市","吴江区","昆山市"],
"0_11_4":["戚墅堰区","金坛市","武进区","钟楼区","溧阳市","新北区","天宁区"],
"0_11_5":["海州区","连云区","新浦区","东海县","灌南县","赣榆县","灌云县"],
"0_11_6":["邗江区","江都区","宝应县","高邮市","仪征市","广陵区"],
"0_11_7":["铜山经济技术开发区","沛县","丰县","八段工业园区","铜山区","睢宁县","鼓楼区","邳州市","贾汪区","金山桥开发区","泉山区","新沂市","云龙区"],
"0_11_8":["大丰市","东台市","射阳县","亭湖区","盐都区","阜宁县","滨海县","建湖县","响水县"],
"0_11_9":["六合区","高淳区","玄武区","江宁区","秦淮区","鼓楼区","建邺区","溧水区","雨花台区","栖霞区","浦口区"],
"0_11_10":["镇江新区","丹徒新区","京口区","句容市","润州区","扬中市","丹阳市","丹徒区"],
"0_11_11":["宿迁经济开发区","宿城区","泗洪县","沭阳县","泗阳县","宿豫区"],
"0_11_12":["南通经济技术开发区","启东市","如东县","海门市","如皋市","通州区","港闸区","崇川区","海安县"],
"0_12_0":["高青县","沂源县","桓台县","博山区","张店区","临淄区","淄川区","周村区"],
"0_12_1":["青州市","诸城市","安丘市","高密市","昌邑市","昌乐县","坊子区","潍城区","高新区","奎文区","寿光市","寒亭区","临朐县"],
"0_12_2":["市中区","滕州市","薛城区","峄城区","台儿庄区","山亭区"],
"0_12_3":["单县","牡丹区","曹县","定陶县","成武县","鄄城县","巨野县","郓城县","东明县"],
"0_12_4":["单县","牡丹区","曹县","定陶县","成武县","鄄城县","巨野县","郓城县","东明县"],
"0_12_5":["河口区","广饶县","东营区","利津县","垦利县"],
"0_12_6":["武城县","德城区","庆云县","宁津县","夏津县","平原县","临邑县","齐河县","禹城市","陵县","乐陵市"],
"0_12_7":["阳信县","邹平县","北海新区","沾化县","惠民县","博兴县","滨城区","无棣县"],
"0_12_8":["平阴县","长清区","商河县","济阳县","章丘市","市中区","历下区","槐荫区","天桥区","高新区","历城区"],
"0_12_9":["临清市","东阿县","莘县","东昌府区","茌平县","阳谷县","高唐县","冠县"],
"0_12_10":["文登市","荣成市","环翠区","乳山市"],
"0_12_11":["东平县","宁阳县","肥城市","泰山区","岱岳区","新泰市"],
"0_12_12":["平度市","黄岛区","市南区","市北区","李沧区","即墨市","城阳区","莱西市","崂山区","胶州市","四方区"],
"0_12_13":["微山县","汶上县","泗水县","嘉祥县","鱼台县","金乡县","高新区","任城区","邹城市","曲阜市","市中区","兖州市","梁山县"],
"0_12_14":["东港区","岚山区","新市区","莒县","五莲县"],
"0_12_15":["开发区","芝罘区","莱山区","龙口市","栖霞市","莱州市","蓬莱市","福山区","长岛县","牟平区","海阳市","莱阳市","招远市"],
"0_12_16":["郯城县","罗庄区","河东区","兰山区","沂水县","沂南县","临沭县","蒙阴县","莒南县","平邑县","兰陵县","费县"],
"0_13_0":["固镇县","五河县","怀远县","禹会区","龙子湖区","淮上区","蚌山区"],
"0_13_1":["南谯区","明光市","来安县","全椒县","天长市","凤阳县","琅琊区","定远县"],
"0_13_2":["镜湖区","南陵县","芜湖县","无为县","繁昌县","三山区","弋江区","鸠江区"],
"0_13_3":["杜集区","相山区","濉溪县","烈山区"],
"0_13_4":["界首市","太和县","阜南县","颍上县","颍东区","临泉县","颍泉区","经济开发区","颍州区"],
"0_13_5":["淮南高新技术开发区","谢家集区","大通区","潘集区","八公山区","田家庵区","凤台县"],
"0_13_6":["休宁县","黟县","歙县","祁门县","徽州区","黄山区","屯溪区"],
"0_13_7":["蜀山区","长丰县","庐江县","瑶海区","庐阳区","高新技术开发区","巢湖市","经济技术开发区","包河区","肥西县","肥东县","北城新区","滨湖新区","政务文化新区","新站综合开发试验区"],
"0_13_8":["东至县","石台县","青阳县","贵池区"],
"0_13_9":["寿县","裕安区","霍邱县","金安区","舒城县","霍山县","金寨县"],
"0_13_10":["泾县","旌德县","广德县","绩溪县","宣州区","郎溪县","宁国市"],
"0_13_11":["利辛县","蒙城县","谯城区","涡阳县"],
"0_13_12":["铜陵县","郊区","狮子山区","铜官山区"],
"0_13_13":["大观区","潜山县","望江县","岳西县","怀宁县","太湖县","枞阳县","宿松县","开发区","桐城市","迎江区","宜秀区"],
"0_13_14":["砀山县","埇桥区","灵璧县","泗县","经济开发区","萧县"],
"0_13_15":["含山县","和县","博望区","雨山区","当涂县","花山区"],
"0_14_0":["柯桥区","越城区","新昌县","嵊州市","上虞区","诸暨市"],
"0_14_1":["临海市","三门县","天台县","黄岩区","椒江区","玉环县","温岭市","路桥区","仙居县"],
"0_14_2":["南浔区","安吉县","德清县","长兴县","吴兴区"],
"0_14_3":["永嘉县","文成县","瓯海区","平阳县","泰顺县","瑞安市","鹿城区","乐清市","龙湾区","茶山高教园区","洞头县","苍南县"],
"0_14_4":["北仑区","高新科技开发区","鄞州区","镇海区","余姚市","象山县","江北区","江东区","海曙区","慈溪市","宁海县","奉化市"],
"0_14_5":["浦江县","磐安县","永康市","武义县","义乌市","东阳市","兰溪市","婺城区","金东区"],
"0_14_6":["定海区","普陀区","嵊泗县","岱山县"],
"0_14_7":["青田县","莲都区","缙云县","遂昌县","龙泉市","庆元县","云和县","松阳县","景宁县"],
"0_14_8":["柯城区","衢江区","龙游县","常山县","开化县","江山市"],
"0_14_9":["秀洲区","南湖区","海盐县","海宁市","嘉善县","平湖市","桐乡市"],
"0_14_10":["淳安县","富阳市","临安市","建德市","桐庐县","滨江区","下沙区","西湖区","余杭区","拱墅区","江干区","萧山区","下城区","上城区"],
"0_15_0":["郧西县","郧县","竹溪县","房县","竹山县","丹江口市","张湾区","茅箭区"],
"0_15_1":["赤壁市","咸安区","嘉鱼县","通山县","崇阳县","通城县"],
"0_15_2":["南漳县","谷城县","保康县","老河口市","宜城市","襄州区","枣阳市","襄城区","樊城区"],
"0_15_3":["胡市镇","石河镇","净潭乡","蒋湖农场","白茅湖农场","沉湖管委会","麻洋镇","多祥镇","干驿镇","马湾镇","卢市镇","小板镇","九真镇","皂市镇","蒋场镇","张港镇","渔薪镇","汪场镇","岳口镇","黄潭镇","彭市镇","横林镇","竟陵街道","侨乡街道开发区","佛子山镇","杨林街道","拖市镇","多宝镇"],
"0_15_4":["咸丰县","宣恩县","鹤峰县","恩施市","利川市","建始县","来凤县","巴东县"],
"0_15_5":["高场原种场","浩口原种场","熊口管理区","总口管理区","周矶管理区","后湖管理区","西大垸管理区","运粮湖管理区","江汉石油管理局","潜江经济开发区","龙湾镇","张金镇","浩口镇","老新镇","熊口镇","王场镇","渔洋镇","积玉口镇","高石碑镇","竹根滩镇","泰丰","广华","周矶","杨市","园林"],
"0_15_6":["应城市","安陆市","汉川市","孝南区","大悟县","孝昌县","云梦县"],
"0_15_7":["城区","沙湖原种场","排湖渔场","工业园区","九合垸原种场","刘家垸林场","畜禽良种场","五湖渔场","赵西垸林场","张沟镇","彭场镇","杨林尾镇","沙湖镇","陈场镇","通海口镇","沔城镇","郭河镇","豆河镇","毛嘴镇","郑场镇","西流河镇","长埫口镇","胡场镇","三伏潭镇"],
"0_15_8":["新华镇","宋洛乡","木鱼镇","红坪镇","松柏镇","阳日镇","下谷坪乡","九湖乡"],
"0_15_9":["曾都区","广水市","随县"],
"0_15_10":["麻城市","武穴市","黄州区","蕲春县","罗田县","红安县","黄梅县","团风县","英山县","浠水县"],
"0_15_11":["京山县","钟祥市","掇刀区","沙洋县","东宝区"],
"0_15_12":["鄂城区","梁子湖区","华容区"],
"0_15_13":["洪湖市","江陵县","沙市区","公安县","监利县","松滋市","石首市","荆州区"],
"0_15_14":["下陆区","西塞山区","黄石港区","经济技术开发区","大冶市","铁山区","阳新县"],
"0_15_15":["东西湖区","江岸区","江夏区","蔡甸区","江汉区","黄陂区","硚口区","新洲区","青山区","汉阳区","汉南区","武昌区","武汉经济技术开发区","洪山区"],
"0_15_16":["秭归县","兴山县","枝江市","夷陵区","长阳土家族自治县","远安县","五峰土家族自治县","点军区","伍家岗区","西陵区","宜都市","猇亭区","当阳市"],
"0_16_0":["龙海市","东山县","长泰县","华安县","芗城区","云霄县","诏安县","漳浦县","龙文区","平和县","南靖县"],
"0_16_1":["霞浦县","寿宁县","福鼎市","东侨开发区","福安市","蕉城区","柘荣县","屏南县","古田县","周宁县"],
"0_16_2":["松溪县","顺昌县","武夷山市","光泽县","建阳市","建瓯市","邵武市","延平区","政和县","浦城县"],
"0_16_3":["荔城区","涵江区","秀屿区","城厢区","仙游县"],
"0_16_4":["集美区","翔安区","同安区","海沧区","湖里区","思明区"],
"0_16_5":["长乐市","连江县","平潭县","福清市","罗源县","台江区","马尾区","永泰县","仓山区","闽清县","晋安区","鼓楼区","闽侯县"],
"0_16_6":["连城县","上杭县","永定县","武平县","长汀县","漳平市","新罗区"],
"0_16_7":["惠安县","南安市","德化县","安溪县","永春县","金门县","泉港区","晋江市","洛江区","鲤城区","丰泽区","石狮市"],
"0_16_8":["明溪县","将乐县","大田县","宁化县","建宁县","沙县","三元区","尤溪县","清流县","泰宁县","梅列区","永安市"],
"0_17_0":["斗门区","金湾区","香洲区"],
"0_17_1":["龙门县","博罗县","惠东县","惠城区","惠阳区","大亚湾区"],
"0_17_2":["潮南区","濠江区","南澳县","潮阳区","澄海区","金平区","龙湖区"],
"0_17_3":["郁南县","新兴县","云安县","云城区","罗定市"],
"0_17_4":["高明区","顺德区","禅城区","南海区","三水区"],
"0_17_5":["坡头区","吴川市","徐闻县","赤坎区","雷州市","霞山区","经济技术开发区","麻章区","遂溪县","廉江市"],
"0_17_6":["梅江区","五华县","平远县","兴宁市","大埔县","丰顺县","梅县","蕉岭县"],
"0_17_7":["黄埔区","广州大学城","越秀区","荔湾区","海珠区","天河区","增城市","从化市","萝岗区","花都区","南沙区","白云区","番禺区"],
"0_17_8":["揭东县","东山区","榕城区","揭西县","惠来县","普宁市"],
"0_17_9":["江城区","阳春市","阳东县","阳西县"],
"0_17_10":["潮安县","枫溪区","饶平县","湘桥区"],
"0_17_11":["连南县","清新县","连山县","佛冈县","阳山县","连州市","英德市","清城区"],
"0_17_12":["坪山新区","大鹏新区","盐田区","龙华新区","龙岗区","光明新区","福田区","罗湖区","宝安区","南山区"],
"0_17_13":["化州市","茂港区","信宜市","茂南区","电白县","高州市"],
"0_17_14":["恩平市","台山市","新会区","蓬江区","开平市","鹤山市","江海区"],
"0_17_15":["龙川县","和平县","连平县","紫金县","源城区","东源县"],
"0_17_16":["南朗镇","古镇","三乡镇","板芙镇","五桂山镇","民众镇","沙溪镇","阜沙镇","港口镇","东升镇","城区","横栏镇","黄圃镇","东凤镇","坦洲镇","小榄镇","南头镇","沙朗镇","大涌镇","三角镇","火炬开发区","神湾镇"],
"0_17_17":["乳源瑶族自治县","新丰县","曲江区","浈江区","武江区","乐昌市","南雄市","始兴县","仁化县","翁源县"],
"0_17_18":["海丰县","陆丰市","陆河县","城区"],
"0_17_19":["常平镇","沙田镇","东城区","高埗镇","石龙镇","东坑镇","南城区","横沥镇","大岭山镇","松山湖","望牛墩镇","寮步镇","长安镇","谢岗镇","樟木头镇","凤岗镇","道滘镇","大朗镇","桥头镇","中堂镇","麻涌镇","塘厦镇","清溪镇","洪梅镇","莞城区","虎门镇","万江区","黄江镇","石排镇","厚街镇","企石镇","石碣镇","茶山镇"],
"0_17_20":["高要市","端州区","鼎湖区","四会市","封开县","广宁县","德庆县","怀集县"],
"0_18_0":["岳塘区","雨湖区","韶山市","湘乡市","湘潭县"],
"0_18_1":["汝城县","嘉禾县","临武县","桂东县","资兴市","宜章县","安仁县","北湖区","苏仙区","桂阳县","永兴县"],
"0_18_2":["汨罗市","岳阳县","湘阴县","华容县","岳阳楼区","临湘市","云溪区","平江县","君山区"],
"0_18_3":["茶陵县","炎陵县","株洲县","石峰区","攸县","天元区","荷塘区","醴陵市","芦淞区"],
"0_18_4":["永定区","慈利县","桑植县","武陵源区"],
"0_18_5":["芷江县","新晃县","靖州县","通道县","中方县","溆浦县","辰溪县","沅陵县","会同县","洪江市","鹤城区","麻阳县"],
"0_18_6":["南岳区","祁东县","衡东县","耒阳市","衡山县","衡南县","常宁市","衡阳县","石鼓区","蒸湘区","雁峰区","珠晖区"],
"0_18_7":["韶山市区内"],
"0_18_8":["鼎城区","武陵区","津市市","澧县","临澧县","桃源县","汉寿县","石门县","安乡县"],
"0_18_9":["大祥区","双清区","北塔区","城步县","新宁县","绥宁县","隆回县","邵阳县","邵东县","武冈市","新邵县","洞口县"],
"0_18_10":["双牌县","江永县","道县","祁阳县","东安县","零陵区","新田县","蓝山县","江华县","宁远县","冷水滩区"],
"0_18_11":["花垣县","凤凰县","泸溪县","永顺县","龙山县","古丈县","吉首市","保靖县"],
"0_18_12":["娄星区","双峰县","新化县","涟源市","冷水江市"],
"0_18_13":["宁乡县","长沙县","望城区","浏阳市","芙蓉区","天心区","开福区","雨花区","岳麓区"],
"0_18_14":["沅江市","赫山区","资阳区","桃江县","南县","安化县"],
"0_19_0":["湘东区","莲花县","上栗县","芦溪县","安源区"],
"0_19_1":["青原区","峡江县","泰和县","安福县","吉州区","遂川县","万安县","吉水县","井冈山市","吉安县","永丰县","永新县","新干县"],
"0_19_2":["昌江区","珠山区","乐平市","浮梁县"],
"0_19_3":["广昌县","临川区","南丰县","乐安县","金溪县","南城县","东乡县","资溪县","宜黄县","崇仁县","黎川县"],
"0_19_4":["湖口县","修水县","都昌县","德安县","武宁县","共青城市","经济技术开发区","星子县","八里湖新区","永修县","彭泽县","瑞昌市","九江县","庐山区","浔阳区","庐山风景名胜区"],
"0_19_5":["上高县","万载县","奉新县","宜丰县","丰城市","袁州区","靖安县","铜鼓县","高安市","樟树市"],
"0_19_6":["龙虎山风景旅游区","余江县","贵溪市","月湖区"],
"0_19_7":["瑞金市","南康市","安远县","石城县","宁都县","赣县","兴国县","寻乌县","章贡区","全南县","信丰县","大余县","崇义县","龙南县","于都县","上犹县","定南县","会昌县"],
"0_19_8":["婺源县","余干县","广丰县","鄱阳县","铅山县","玉山县","横峰县","弋阳县","万年县","信州区","德兴市","上饶县"],
"0_19_9":["渝水区","分宜县"],
"0_19_10":["湾里区","青山湖区","红谷滩新区","青云谱区","西湖区","东湖区","高新区","昌北区","南昌县","进贤县","安义县","新建县"],
"0_20_0":["容县","玉州区","北流市","兴业县","陆川县","博白县"],
"0_20_1":["南丹县","凤山县","罗城县","天峨县","宜州市","都安县","金城江区","东兰县","大化县","巴马县","环江县"],
"0_20_2":["武宣县","忻城县","金秀县","象州县","合山市","兴宾区"],
"0_20_3":["蒙山县","万秀区","长洲区","蝶山区","岑溪市","藤县","苍梧县"],
"0_20_4":["右江区","隆林县","凌云县","那坡县","田东县","靖西县","德保县","田林县","西林县","田阳县","乐业县","平果县"],
"0_20_5":["海城区","合浦县","铁山港区","银海区"],
"0_20_6":["兴宁区","宾阳县","青秀区","武鸣县","西乡塘区","良庆区","江南区","邕宁区","横县","上林县","隆安县","马山县"],
"0_20_7":["防城区","港口区","东兴市","上思县"],
"0_20_8":["灵川县","临桂县","秀峰区","平乐县","全州县","七星区","灌阳县","叠彩区","兴安县","资源县","荔浦县","永福县","龙胜县","恭城县","象山区","阳朔县","雁山区"],
"0_20_9":["钦南区","浦北县","灵山县","钦北区"],
"0_20_10":["覃塘区","港南区","港北区","桂平市","平南县"],
"0_20_11":["平桂管理区","八步区","昭平县","富川县","钟山县"],
"0_20_12":["扶绥县","大新县","凭祥市","龙州县","天等县","宁明县","江州区"],
"0_20_13":["融安县","三江县","融水县","鱼峰区","鹿寨县","城中区","柳城县","柳南区","柳北区","柳江县"],
"0_21_0":["中平镇","上安乡","什运乡","黎母山镇","和平镇","长征镇","红毛镇","阳江农场","黎母山林业公司","吊罗山乡","营根镇","湾岭镇","长征农场","城区","乌石农场","加钗农场"],
"0_21_1":["邦溪农场","龙江农场","白沙农场","牙叉镇","七坊镇","荣邦乡","细水乡","青松乡","元门乡","金波乡","南开乡","邦溪镇","阜龙乡","打安镇","城区"],
"0_21_2":["霸王岭林场","海南矿业公司","城区","王下乡","七叉镇","十月田镇","乌烈镇","石碌镇","叉河镇","红林农场","昌化镇","海尾镇"],
"0_21_3":["坡心镇","西昌镇","南吕镇","县城内","南坤镇","乌坡镇","中坤农场","枫木镇","中建农场","新兴镇","屯城镇"],
"0_21_4":["西沙群岛","中沙群岛","南沙群岛"],
"0_21_5":["黄流镇","佛罗镇","保国农场","九所镇","乐光农场","利国镇","山荣农场","莺歌海盐场","千家镇","尖峰岭林业公司","志仲镇","万冲镇","大安镇","抱由镇","城区","莺歌海镇","尖峰镇"],
"0_21_6":["南林乡","毛感乡","三道农场","金江农场","响水镇","新星农场","新政镇","保亭研究所","三道镇","六弓乡","加茂镇","什玲镇","保城镇"],
"0_21_7":["岭门农场","吊罗山林业公司","南平农场","群英乡","城区","提蒙乡","黎安镇","新村镇","本号镇","文罗镇","隆广镇","英州镇","三才镇","光坡镇","椰林镇"],
"0_21_8":["毛道乡","畅好乡","水满乡","南圣镇","通什镇","畅好农场","番阳镇","毛阳镇"],
"0_21_9":["锦山镇","铺前镇","抱罗镇","冯坡镇","昌洒镇","翁田镇","东郊镇","龙楼镇","橡胶研究所","文教镇","东阁镇","南阳农场","潭牛镇","罗豆农场","东路镇","会文镇","湖山乡","东路农场","蓬莱镇","重兴镇","宝芳乡","文城镇","龙马乡","南阳镇","清谰镇","头苑镇","新桥镇","迈号镇","公坡镇"],
"0_21_10":["黄竹镇","城区","南海农场","定城镇","金鸡岭农场","中瑞农场","龙门镇","雷鸣镇","龙湖镇","新竹镇","富文镇","翰林镇","岭口镇","龙河镇"],
"0_21_11":["金安农场","金江镇","西达农场","老城镇","瑞溪镇","红光农场","城区","永发镇","大丰镇","加乐镇","文儒镇","中兴镇","桥头镇","福山镇","仁兴镇"],
"0_21_12":["东英镇","博厚镇","皇桐镇","多文镇","和舍镇","南宝镇","新盈镇","加来农场","调楼镇","加来镇","红华农场","城区","波莲镇","临城镇"],
"0_21_13":["富克镇","洋浦经济开发区","新州镇","东成镇","排浦镇","中和镇","白马井镇","王五镇","三都镇","热作学院","和庆镇","南丰镇","大成镇","红岭农场","龙山农场","西庆农场","海头镇","峨蔓镇","西华农场","新盈农场","西流农场","雅星镇","西联农场","兰洋镇","西培农场","光村镇","那大镇","八一农场","木棠镇","蓝洋农场"],
"0_21_14":["育才镇","天涯镇","河西区","河东区","崖城镇","南田农场","吉阳镇","凤凰镇","海棠湾镇","南新农场","南岛农场","立才农场","南滨农场"],
"0_21_15":["会山镇","潭门镇","塔洋镇","长坡镇","大路镇","东太农场","东红农场","东升农场","南俸农场","彬村山华侨农场","阳江镇","博鳌镇","龙江镇","万泉镇","嘉积镇","中原镇","石壁镇"],
"0_21_16":["广坝农场","东方华侨农场","东河镇","八所镇","感城镇","大田镇","三家镇","板桥镇","新龙镇","四更镇","江边乡","天安乡"],
"0_21_17":["礼纪镇","长丰镇","大茂镇","东澳镇","和乐镇","后安镇","万城镇","龙滚镇","北大镇","山根镇","三更罗镇","南桥镇","新中农场","兴隆华侨农场","东兴农场","东和农场","六连林场"],
"0_21_18":["琼山区","美兰区","秀英区","龙华区"],
"0_22_0":["乐至县","简阳市","安岳县","雁江区"],
"0_22_1":["通川区","达县","大竹县","渠县","万源市","宣汉县","开江县"],
"0_22_2":["会理县","昭觉县","西昌市","美姑县","德昌县","宁南县","普格县","会东县","雷波县","越西县","喜德县","甘洛县","冕宁县","盐源县","金阳县","布拖县","木里县"],
"0_22_3":["宜宾县","翠屏区","南溪区","兴文县","珙县","江安县","长宁县","筠连县","高县","屏山县"],
"0_22_4":["马尔康县","红原县","九寨沟县","阿坝县","若尔盖县","汶川县","理县","小金县","金川县","壤塘县","茂县","黑水县","松潘县"],
"0_22_5":["仁和区","盐边县","西区","东区","米易县"],
"0_22_6":["恩阳区","巴州区","南江县","平昌县","通江县"],
"0_22_7":["安居区","船山区","大英县","蓬溪县","射洪县"],
"0_22_8":["富顺县","沿滩区","自流井区","荣县","大安区","贡井区"],
"0_22_9":["元坝区","朝天区","剑阁县","苍溪县","利州区","青川县","旺苍县"],
"0_22_10":["芦山县","石棉县","名山区","天全县","荥经县","汉源县","宝兴县","雨城区"],
"0_22_11":["岳池县","邻水县","武胜县","华蓥市","广安区","前锋区"],
"0_22_12":["巴塘县","理塘县","雅江县","石渠县","得荣县","乡城县","稻城县","泸定县","九龙县","康定县","炉霍县","色达县","丹巴县","道孚县","白玉县","德格县","甘孜县","新龙县"],
"0_22_13":["南部县","阆中市","嘉陵区","西充县","蓬安县","顺庆区","仪陇县","高坪区","营山县"],
"0_22_14":["威远县","隆昌县","资中县","东兴区","市中区"],
"0_22_15":["叙永县","合江县","古蔺县","泸县","纳溪区","龙马潭区","江阳区"],
"0_22_16":["峨边县","马边县","犍为县","沐川县","峨眉山市","沙湾区","五通桥区","市中区","井研县","夹江县","金口河区"],
"0_22_17":["青神县","东坡区","仁寿县","彭山县","洪雅县","丹棱县"],
"0_22_18":["崇州市","彭州市","青白江区","龙泉驿区","温江区","新都区","金堂县","蒲江县","大邑县","双流县","新津县","郫县","都江堰市","邛崃市","金牛区","武侯区","青羊区","锦江区","成华区","高新区","高新西区"],
"0_22_19":["平武县","涪城区","北川县","游仙区","安县","梓潼县","江油市","盐亭县","三台县","经开区","高新区"],
"0_22_20":["罗江县","绵竹市","中江县","旌阳区","什邡市","广汉市"],
"0_23_0":["元谋县","楚雄市","南华县","牟定县","武定县","大姚县","姚安县","双柏县","禄丰县","永仁县"],
"0_23_1":["西山区","五华区","官渡区","富民县","嵩明县","东川区","安宁市","呈贡区","寻甸县","石林县","盘龙区","晋宁县","禄劝县","宜良县"],
"0_23_2":["华坪县","永胜县","玉龙县","宁蒗县","古城区"],
"0_23_3":["昭阳区","鲁甸县","绥江县","威信县","巧家县","水富县","彝良县","盐津县","大关县","永善县","镇雄县"],
"0_23_4":["龙陵县","腾冲县","施甸县","昌宁县","隆阳区"],
"0_23_5":["文山市","麻栗坡县","马关县","富宁县","砚山县","广南县","西畴县","丘北县"],
"0_23_6":["大理市","鹤庆县","洱源县","祥云县","宾川县","巍山县","永平县","南涧县","漾濞县","剑川县","弥渡县","云龙县"],
"0_23_7":["个旧市","绿春县","红河县","弥勒县","开远市","元阳县","建水县","泸西县","蒙自市","河口县","屏边县","金平县","石屏县"],
"0_23_8":["双江县","永德县","沧源县","耿马县","凤庆县","云县","临翔区","镇康县"],
"0_23_9":["德钦县","维西县","香格里拉县"],
"0_23_10":["江川县","元江县","新平县","峨山县","华宁县","澄江县","易门县","通海县","红塔区"],
"0_23_11":["墨江县","景谷县","孟连县","镇沅县","景东县","宁洱县","思茅区","江城县","澜沧县","西盟县"],
"0_23_12":["芒市","盈江县","瑞丽市","陇川县","梁河县"],
"0_23_13":["陆良县","会泽县","罗平县","师宗县","马龙县","富源县","宣威市","麒麟区","沾益县"],
"0_23_14":["勐腊县","勐海县","景洪市"],
"0_23_15":["贡山县","福贡县","兰坪县","泸水县"],
"0_24_0":["盘县","钟山区","六枝特区","水城县"],
"0_24_1":["普定县","西秀区","平坝县","镇宁布依族苗族自治县","关岭布依族苗族自治县","紫云苗族布依族自治县"],
"0_24_2":["三都县","长顺县","独山县","都匀市","惠水县","罗甸县","福泉市","贵定县","龙里县","平塘县","瓮安县","荔波县"],
"0_24_3":["凯里市","施秉市","黎平县","雷山县","三穗县","剑河县","丹寨县","岑巩县","麻江县","镇远县","锦屏县","从江县","榕江县","黄平县","天柱县","台江县"],
"0_24_4":["息烽县","乌当区","开阳县","修文县","清镇市","南明区","小河区","观山湖区","花溪区","云岩区","白云区"],
"0_24_5":["普安县","册亨县","晴隆县","贞丰县","安龙县","兴义市","望谟县","兴仁县"],
"0_24_6":["金沙县","织金县","纳雍县","赫章县","威宁彝族回族苗族自治县","七星关区","大方县","黔西县"],
"0_24_7":["务川县","道真县","余庆县","湄潭县","正安县","凤冈县","习水县","绥阳县","红花岗区","汇川区","遵义县","桐梓县","赤水市","仁怀市"],
"0_24_8":["松桃苗族自治县","石阡县","玉屏侗族自治县","万山区","沿河土家族自治县","思南县","印江土家族苗族自治县","江口县","德江县","碧江区"],
"0_25_0":["南郑县","汉台区","留坝县","佛坪县","洋县","城固县","勉县","略阳县","镇巴县","西乡县","宁强县"],
"0_25_1":["金台区","陈仓区","眉县","渭滨区","凤县","扶风县","千阳县","麟游县","陇县","凤翔县","太白县","岐山县"],
"0_25_2":["岚皋县","紫阳县","旬阳县","镇坪县","平利县","宁陕县","汉阴县","石泉县","白河县","汉滨区"],
"0_25_3":["潼关县","华县","临渭区","澄城县","大荔县","韩城市","蒲城县","华阴市","白水县","合阳县","富平县"],
"0_25_4":["王益区","耀州区","宜君县","印台区"],
"0_25_5":["礼泉县","泾阳县","秦都区","永寿县","渭城区","三原县","兴平市","乾县","武功县","淳化县","彬县","杨陵区","旬邑县","长武县"],
"0_25_6":["宝塔区","吴起县","延川县","宜川县","延长县","黄陵县","黄龙县","志丹县","富县","甘泉县","安塞县","子长县","洛川县"],
"0_25_7":["靖边县","佳县","清涧县","绥德县","子洲县","神木县","府谷县","米脂县","横山县","定边县","吴堡县","榆阳区"],
"0_25_8":["商南县","洛南县","柞水县","丹凤县","商州区","山阳县","镇安县"],
"0_25_9":["西安武警工程学院","户县","周至县","高陵县","蓝田县","长安区","未央区","雁塔区","杨凌农业示范区","新城区","阎良区","临潼区","莲湖区","碑林区","灞桥区"],
"0_26_0":["浪卡子县","贡嘎县","乃东县","扎囊县","桑日县","琼结县","曲松县","措美县","洛扎县","加查县","隆子县","错那县"],
"0_26_1":["察隅县","朗县","波密县","墨脱县","米林县","工布江达县","林芝县"],
"0_26_2":["日喀则市","南木林县","昂仁县","江孜县","定日县","聂拉木县","萨迦县　","拉孜县","谢通门县","岗巴县","仁布县","白朗县","定结县","康马县","亚东县","仲巴县","萨嘎县","吉隆县"],
"0_26_3":["日土县","札达县　","普兰县","噶尔县","措勤县","改则县","革吉县"],
"0_26_4":["当雄县","尼木县","城关区","墨竹工卡县","林周县","达孜县","堆龙德庆县","曲水县"],
"0_26_5":["那曲县","比如县","嘉黎县","安多县","聂荣县","尼玛县","班戈县","巴青县","申扎县","索县"],
"0_26_6":["芒康县","左贡县","八宿县","察雅县","边坝县","洛隆县","丁青县","类乌齐县","贡觉县","江达县","昌都县"],
"0_27_0":["城东区","湟中县","城中区","城北区","大通县","城西区","湟源县"],
"0_27_1":["囊谦县","称多县","玉树县","曲麻莱县","治多县","杂多县"],
"0_27_2":["尖扎县","同仁县","河南县","泽库县"],
"0_27_3":["门源县","祁连县","刚察县","海晏县"],
"0_27_4":["都兰县","大柴旦行委","冷湖行委","茫崖行委","格尔木市","天峻县","乌兰县","德令哈市"],
"0_27_5":["玛多县","久治县","班玛县","达日县","玛沁县","甘德县"],
"0_27_6":["互助县","民和县","循化县","化隆县","乐都县","平安县"],
"0_27_7":["贵南县","同德县","共和县","兴海县","贵德县"],
"0_28_0":["长城区","雄关区","镜铁区"],
"0_28_1":["张家川县","秦安县","清水县","武山县","甘谷县","麦积区","秦州区"],
"0_28_2":["徽县","两当县","西和县","宕昌县","康县","礼县","文县","武都区","成县"],
"0_28_3":["玉门市","敦煌市","金塔县","肃州区","阿克塞县","肃北县","瓜州县"],
"0_28_4":["合作市","夏河县","碌曲县","卓尼县","舟曲县","玛曲县","迭部县","临潭县"],
"0_28_5":["漳县","临洮县","岷县","陇西县","渭源县","通渭县","安定区"],
"0_28_6":["西峰区","庆城县","正宁县","宁县","合水县","镇原县","环县","华池县"],
"0_28_7":["永昌县","金川区"],
"0_28_8":["会宁县","景泰县","靖远县","平川区","白银区"],
"0_28_9":["庄浪县","灵台县","崆峒区","镇原县","崇信县","泾川县","静宁县","华亭县"],
"0_28_10":["和政县","永靖县","积石山县","东乡族自治县","临夏市","临夏县","康乐县","广河县"],
"0_28_11":["临泽县","高台县","肃南县","民乐县","甘州区","山丹县"],
"0_28_12":["民勤县","凉州区","古浪县","天祝县"],
"0_28_13":["永登县","榆中县","皋兰县","城关区","七里河区","红古区","安宁区","西固区"],
"0_29_0":["沙雅县","温宿县","阿克苏市","柯坪县","库车县","阿瓦提县","拜城县","乌什县","阿拉尔市","新和县"],
"0_29_1":["福海县","哈巴河县","吉木乃县","布尔津县","富蕴县","青河县","阿勒泰市","北屯市"],
"0_29_2":["阜康市","奇台县","玛纳斯县","昌吉市","木垒县","呼图壁县","吉木萨尔县"],
"0_29_4":["且末县","焉耆县","博湖县","和硕县","轮台县","若羌县","库尔勒市","尉犁县","和静县"],
"0_29_5":["乌鲁木齐县","沙依巴克区","头屯河区","水磨沟区","达坂城区","米东区","天山区","新市区"],
"0_29_6":["莎车县","麦盖提县","塔什库尔干县","疏附县","岳普湖县","英吉沙县","疏勒县","泽普县","喀什市","巴楚县","叶城县","伽师县"],
"0_29_7":["托里县","和布克赛尔县","裕民县","沙湾县","乌苏市","额敏县","塔城市"],
"0_29_8":["五家渠市"],
"0_29_9":["白碱滩区","独山子区","克拉玛依区","乌尔禾区"],
"0_29_10":["吐鲁番市","托克逊县","鄯善县"],
"0_29_11":["图木舒克市"],
"0_29_12":["阿拉尔市"],
"0_29_13":["石河子市"],
"0_29_14":["哈密市","巴里坤县","伊吾县"],
"0_29_15":["阿合奇县","阿图什市","阿克陶县","乌恰县"],
"0_29_16":["巩留县","察布查尔县","霍城县","新源县","昭苏县","尼勒克县","特克斯县","伊宁市","奎屯市","伊宁县"],
"0_29_17":["皮山县","民丰县","于田县","和田县","和田市","洛浦县","策勒县","墨玉县"],
"0_29_18":["温泉县","精河县","博乐市"],
"0_30_0":["兴庆区","灵武市","西夏区","永宁县","金凤区","贺兰县"],
"0_30_1":["西吉县","泾源县","隆德县","原州区","彭阳县"],
"0_30_2":["沙坡头区","海原县","中宁县"],
"0_30_3":["平罗县","惠农区","大武口区"],
"0_30_4":["同心县","红寺堡开发区","盐池县","利通区","青铜峡市"],
"0_31_0":["台湾市区内"],
"0_32_0":["香港市区内"],
"0_33_0":["澳门市区内"],
"0_34_0":["钓鱼岛"],
};
/****************************************
* name:zcity
* tips:城市联动
****************************************/
function zcity(id){
	var cityIni='';
	var cityRange='';
	var zcityItem='.zcityItem';
	var itemLevel='item-level';
	var zcityItemHead='.zcityItem-head';
	var zcityItemMain='.zcityItem-main';
	var currentValue='.currentValue';
	var citylist='.citylist';
	var cityitem='.cityitem';
	var cityTips='.cityTips'
	var cityDefaultTips='请选择';//默认提示
	/****************************************
	* name:cityIni
	* tips:初始化
	****************************************/
	if($(id).attr('city-range')!=null && $(id).attr('city-range')!=undefined && $(id).attr('city-range')!=''){
		cityRange=strToJson($(id).attr('city-range'));
		var leavelStart=parseInt(cityRange.level_start,10);
		var leavelEnd=parseInt(cityRange.level_end,10);
		if(leavelEnd<leavelStart){
			alertTips('warning','城市区间配置最大值不能小于最小值！');
			return;
		}else{
			$(id).html('');
			if($(id).attr('city-ini')!=null && $(id).attr('city-ini')!=undefined && $(id).attr('city-ini')!=''){
				//有初始值
				cityIni=$(id).attr('city-ini').split(",");
				for(var i=0;i<=leavelEnd-leavelStart;i++){
					var currCityIni=cityIni[i];
					if(currCityIni==undefined){
						currCityIni='';
					}
					$(id).append(addItemHtml(i+leavelStart,currCityIni));	
					if(i==0){
						iniLevel(i+leavelStart);//插入层级数据	
					}else{
						iniNameIndexVal(i+leavelStart,cityIni[i]);
					}													
				}
			}else{
				//没有初始值
				for(var i=0;i<=leavelEnd-leavelStart;i++){
					$(id).append(addItemHtml(i+leavelStart,''));
					if(i==0){
						iniLevel(i+leavelStart);//插入层级数据		
					}else{

					}
				}
			}
		}
	}
 	/***************************************
	* name: clickTargetOut
	* tips: 点击DIV之外隐藏Target
	****************************************/
	$(document).on('click',function(e){
		if($(e.target).parents(id).length == 0){
			$(id+' '+zcityItem).removeClass('on');
        }
	});	
	/****************************************
	* name:zcityItemHead
	* tips:点击头部
	****************************************/
	$(document).on('click',id+' '+zcityItemHead,function(){
		if($(this).parents(zcityItem).hasClass('on')){
			$(this).parents(zcityItem).removeClass('on');
		}else{
			$(id+' '+zcityItem).removeClass('on');
			$(this).parents(zcityItem).addClass('on');
		}
		setPosition(this);
	});
	/****************************************
	* name:setPosition
	* tips:设置下拉位置
	****************************************/
	function setPosition(target){
		var diffBottomH=50;//与底部相差高度
		var drapDownMainMinWidth=70;//下拉内容的最小宽度
		var windowH=$(window).height();
		var windowT=$(window).scrollTop();
		var headH=$(target).outerHeight();
		var headW=$(target).outerWidth();
		var mainH=$(target).siblings('.zcityItem-main').outerHeight();
		var mainW=0;
		//监听主区域滚动
		$(window).on('scroll',function(){
			$('.zcityGroup .zcityItem').removeClass('on');
		});
		$(window).resize(function(){
			$('.zcityGroup .zcityItem').removeClass('on');
		});	
		if(headW<drapDownMainMinWidth){
			$(target).siblings('.zcityItem-main').css({'width':drapDownMainMinWidth});
			mainW=drapDownMainMinWidth;
		}else{
			$(target).siblings('.zcityItem-main').css({'width':headW});
			mainW=headW;
		}
		var showTop=$(target).offset().top;
		var showLeft=$(target).offset().left;
		var bodyScrollTop=$('body').scrollTop();
		if(windowH+windowT>showTop+mainH+diffBottomH){//判断向上还是向下
			$(target).siblings('.zcityItem-main').css({'left':showLeft-(mainW-headW),'top':showTop+headH-bodyScrollTop});
		}else{
			$(target).siblings('.zcityItem-main').css({'left':showLeft-(mainW-headW),'top':showTop-mainH-bodyScrollTop});
		}
	}
	/****************************************
	* name:iniLevel
	* tips:初始化层级数据
	****************************************/
	function iniLevel(level){
		$(id).find(zcityItem+'['+itemLevel+'="'+level+'"]'+' '+citylist).html('');//清空
		/****************************************
		* name:each
		* tips:遍历数据 - 获得对应层级数据
		****************************************/
		var curLength=0;
		var curItemLi='';
		$.each(zcityData,function(name,value){
			//console.log(name);
			//console.log(value);
			if(strAppearNumber('_',name)==level-1){
				curLength=value.length;
				for(var u=0;u<curLength;u++){
					curItemLi=curItemLi+'<li class="cityitem" values="'+value[u]+'">'+value[u]+'</li>';
				}
			}
		});
		$(id).find(zcityItem+'['+itemLevel+'="'+level+'"]'+' '+citylist).html(curItemLi);//重新赋值
	}
	/****************************************
	* name:iniNameIndexVal
	* tips:初始化名称索引对应数组值
	****************************************/
	function iniNameIndexVal(level,cityName){
		var nameIndex=0;
		$(id).find(zcityItem+'['+itemLevel+'="'+level+'"]'+' '+citylist).html('');//清空
		/****************************************
		* name:each
		* tips:遍历数据 - 获得对应层级数据
		****************************************/
		$.each(zcityData,function(name,value){
			//console.log(name);
			//console.log(value);
			if(strAppearNumber('_',name)==level-1){
				curLength=value.length;
				for(var u=0;u<curLength;u++){
					if(value[u]==cityName){
						nameIndex=name;
						return;
					}
				}
			}
		});
		var curItemLi='';
		var curLength=zcityData[nameIndex].length;
		for(var k=0;k<curLength;k++){
			curItemLi=curItemLi+'<li class="cityitem" values="'+zcityData[nameIndex][k]+'">'+zcityData[nameIndex][k]+'</li>';
		}
		$(id).find(zcityItem+'['+itemLevel+'="'+level+'"]'+' '+citylist).html(curItemLi);//重新赋值
	}
	/****************************************
	* name:iniSonLeavel
	* tips:初始化子级数组值
	****************************************/
	function iniSonLeavel(level,cityName){
		var sonLevel=parseInt(level,10)+1;
		var nameIndex=0;
		$(id).find(zcityItem+'['+itemLevel+'="'+level+1+'"]'+' '+citylist).html('');//清空
		/****************************************
		* name:each
		* tips:遍历数据 - 获得对应层级数据
		****************************************/
		$.each(zcityData,function(name,value){
			//console.log(name);
			//console.log(value);
			if(strAppearNumber('_',name)==level-1){
				curLength=value.length;
				for(var u=0;u<curLength;u++){
					if(value[u]==cityName){
						nameIndex=name+'_'+u;
						return;
					}
				}
			}
		});
		var curItemLi='';
		var curLength=zcityData[nameIndex].length;
		for(var k=0;k<curLength;k++){
			curItemLi=curItemLi+'<li class="cityitem" values="'+zcityData[nameIndex][k]+'">'+zcityData[nameIndex][k]+'</li>';
		}
		$(id).find(zcityItem+'['+itemLevel+'="'+sonLevel+'"]'+' '+citylist).html(curItemLi);//重新赋值
	}
	/****************************************
	* name:addItemHtml
	* tips:动态添加ITEMHTML
	****************************************/
	function addItemHtml(itemLevel,iniVal){
		var curHtml='<div class="zcityItem" item-level="'+itemLevel+'">'+
						'<div class="zcityItem-head">'+
						     '<input type="text" class="currentValue" readonly value="'+iniVal+'" placeholder="请选择">'+
						'</div>'+
						'<div class="zcityItem-main">'+
						     '<div class="cityContainer">'+
								  '<div class="cityTips">'+cityDefaultTips+'</div>'+
								  '<ul class="citylist"></ul>'+
						     '</div>'+
						'</div>'+
				    '</div>';
		return curHtml;
	}
	/****************************************
	* name:cityitem
	* tips:点击值
	****************************************/
	$(document).on('click',cityitem,function(){
		var curCityItemValue=$(this).attr('values');
		$(this).parents(zcityItem).removeClass('on');
		$(this).parents(zcityItem).find(currentValue).val(curCityItemValue);
		if($(this).parents(id).attr('city-range')==undefined||$(this).parents(id).attr('city-range')==null||$(this).parents(id).attr('city-range')==''){
			return;
		}
		var curCityRange=strToJson($(this).parents(id).attr('city-range'));
		var curLeavelStart=parseInt(curCityRange.level_start,10);
		var curLeavelEnd=parseInt(curCityRange.level_end,10);
		var curItemLeavel=parseInt($(this).parents(zcityItem).attr(itemLevel),10);
		if(curItemLeavel<curLeavelEnd){
			//清空所有子级赋值
			for(var p=curItemLeavel;p<curLeavelEnd;p++){
				$(id).find(zcityItem+'['+itemLevel+'="'+(p+1)+'"]').find(currentValue).val('');//清空
				$(id).find(zcityItem+'['+itemLevel+'="'+(p+1)+'"]'+' '+citylist).html('');//清空
			}
			//重新赋值相邻子级
			iniSonLeavel(curItemLeavel,curCityItemValue);
		}
	});
	/****************************************
	* name:cityTips
	* tips:点击默认提示
	****************************************/
	$(document).on('click',cityTips,function(){
		$(this).parents(zcityItem).find(currentValue).val('');
		$(this).parents(zcityItem).removeClass('on');
	});
	/****************************************
	* name:strAppearNumber
	* tips:字符串出现次数
	****************************************/
	function strAppearNumber(findStr,sourceStr){
		findStr=eval("/"+findStr+"/ig");
		if(sourceStr.match(findStr)==null||sourceStr.match(findStr)==undefined){
			return 0;
		}else{
			return sourceStr.match(findStr).length;
		}
	}
	/***************************************
	* name: strToJson
	* tips: 字符串转Json
	****************************************/
	function strToJson(str){ 
		var json = eval('(' + str + ')'); 
		return json; 
	} 
}
/****************************************
* name:zcityrun
* tips:城市联动运行
****************************************/
function zcityrun(id){
	var size=$(id).size();
	for(var i=0;i<size;i++){
		var curZcityId=$(id).eq(i).attr('zcity-id','zcity'+i);
	}
	for(var u=0;u<size;u++){
		zcity(id+'[zcity-id="zcity'+u+'"]');
	}
}

